{"Profile":"default","Account Number":"012345678912","Control":"[check11] Avoid the use of the root account","Message":"eu-central-1: Root user in the account wasn't accessed in the last 1 days","Severity":"High","Status":"Pass","Scored":"","Level":"","Control ID":"1.01","Region":"eu-central-1","Timestamp":"2021-08-23T06:38:21Z","Compliance":"Software and Configuration Checks","Service":"iam","CAF Epic":"IAM","Risk":"The \"root\" account has unrestricted access to all resources in the AWS account. It is highly recommended that the use of this account be avoided.","Remediation":"Follow the remediation instructions of the Ensure IAM policies are attached only to groups or roles recommendation.","Doc link":"http://docs.aws.amazon.com/IAM/latest/UserGuide/best-practices.html","Resource ID":"root"}
{"Profile":"default","Account Number":"012345678912","Control":"[check114] Ensure hardware MFA is enabled for the root account","Message":"eu-central-1: Only Virtual MFA is enabled for root","Severity":"Critical","Status":"FAIL","Scored":"","Level":"","Control ID":"1.14","Region":"eu-central-1","Timestamp":"2021-08-23T06:38:46Z","Compliance":"Software and Configuration Checks","Service":"iam","CAF Epic":"IAM","Risk":"The root account is the most privileged user in an AWS account. MFA adds an extra layer of protection on top of a user name and password. With MFA enabled when a user signs in to an AWS website they will be prompted for their user name and password as well as for an authentication code from their AWS MFA device. For Level 2 it is recommended that the root account be protected with a hardware MFA.","Remediation":"Using IAM console navigate to Dashboard and expand Activate MFA on your root account.","Doc link":"https://docs.aws.amazon.com/IAM/latest/UserGuide/id_root-user.html#id_root-user_manage_mfa","Resource ID":"MFA"}
{"Profile":"default","Account Number":"012345678912","Control":"[extra796] Restrict Access to the EKS Control Plane Endpoint","Message":"eu-central-1: Cluster control plane access is not restricted for EKS cluster prod","Severity":"High","Status":"FAIL","Scored":"","Level":"","Control ID":"7.96","Region":"eu-central-1","Timestamp":"2021-08-23T07:06:12Z","Compliance":"Software and Configuration Checks","Service":"eks","CAF Epic":"Infrastructure Security","Risk":"By default; this API server endpoint is public to the internet; and access to the API server is secured using a combination of AWS Identity and Access Management (IAM) and native Kubernetes Role Based Access Control (RBAC).","Remediation":"You should enable private access to the Kubernetes API server so that all communication between your nodes and the API server stays within your VPC. You can limit the IP addresses that can access your API server from the internet; or completely disable internet access to the API server.","Doc link":"https://docs.aws.amazon.com/eks/latest/userguide/cluster-endpoint.html","Resource ID":"prod-eksc"}
{"Profile":"default","Account Number":"012345678912","Control":"[extra794] Ensure EKS Control Plane Audit Logging is enabled for all log types","Message":"eu-central-1: Control plane logging is not enabled for EKS cluster prod","Severity":"Medium","Status":"FAIL","Scored":"","Level":"","Control ID":"7.94","Region":"eu-central-1","Timestamp":"2021-08-23T07:06:05Z","Compliance":"Software and Configuration Checks","Service":"eks","CAF Epic":"Logging and Monitoring","Risk":"If logs are not enabled; monitoring of service use and threat analysis is not possible.","Remediation":"Make sure you logging for EKS control plane is enabled.","Doc link":"https://docs.aws.amazon.com/eks/latest/userguide/logging-monitoring.html","Resource ID":"prod-eksc"}
{"Profile":"default","Account Number":"012345678912","Control":"[check116] Ensure IAM policies are attached only to groups or roles","Message":"eu-central-1: prod.config_read.iam has inline policy directly attached","Severity":"Low","Status":"FAIL","Scored":"","Level":"","Control ID":"1.16","Region":"eu-central-1","Timestamp":"2021-08-23T06:39:14Z","Compliance":"ens-op.acc.3.aws.iam.1","Service":"iam","CAF Epic":"IAM","Risk":"By default IAM users; groups; and roles have no access to AWS resources. IAM policies are the means by which privileges are granted to users; groups; or roles. It is recommended that IAM policies be applied directly to groups and roles but not users. Assigning privileges at the group or role level reduces the complexity of access management as the number of users grow. Reducing access management complexity may in-turn reduce opportunity for a principal to inadvertently receive or retain excessive privileges.","Remediation":"Remove any policy attached directly to the user. Use groups or roles instead.","Doc link":"https://docs.aws.amazon.com/IAM/latest/UserGuide/best-practices.html","Resource ID":"dtpa.prod.config_read.iam"}
{"Profile":"default","Account Number":"012345678912","Control":"[check117] Maintain current contact details","Message":"No command available for check 1.17. See section 1.17 on the CIS Benchmark guide for details.","Severity":"Medium","Status":"Info","Scored":"","Level":"","Control ID":"1.17","Region":"eu-central-1","Timestamp":"2021-08-23T06:40:21Z","Compliance":"Software and Configuration Checks","Service":"support","CAF Epic":"IAM","Risk":"Ensure contact email and telephone details for AWS accounts are current and map to more than one individual in your organization. An AWS account supports a number of contact details; and AWS will use these to contact the account owner if activity judged to be in breach of Acceptable Use Policy. If an AWS account is observed to be behaving in a prohibited or suspicious manner; AWS will attempt to contact the account owner by email and phone using the contact details listed. If this is unsuccessful and the account behavior needs urgent mitigation; proactive measures may be taken; including throttling of traffic between the account exhibiting suspicious behavior and the AWS API endpoints and the Internet. This will result in impaired service to and from the account in question.","Remediation":"Using the Billing and Cost Management console complete contact details.","Doc link":"https://docs.aws.amazon.com/awsaccountbilling/latest/aboutv2/manage-account-payment.html#contact-info","Resource ID":""}
